"""
Created on 2021/04/25
@author: cyr
@site: https://github.com/Doriskirsy
@description: shared parameters
"""


import sys

Root = sys.path[0]

Rounds = 20  # 题目数
Rounds_pic = [i for i in range(1, 18+1)]   # 含图片题号
Rounds_video = [19, 20]       # 含视频题号
Round_now = 0       # 当前题号

Add_pic = {Rounds_pic[i]: (Root + "/pics_rc/test/" + str(Rounds_pic[i]) + ".png") for i in range(len(Rounds_pic))}   # 测试图片地址
Add_video = {Rounds_video[i]: (Root + "/videos_rc/" + str(Rounds_video[i]) + ".mp4") for i in range(len(Rounds_video))}    # 测试视频地址

Questions = ["在周末你喜欢：",\
             "与朋友交往时，你倾向于看重：",\
             "你喜欢哪种工作：",\
             "遇到伤心的事情，你更倾向于：",\
             "你是个时间观念很强的人吗",\
             "你时常容易流露和说出你的感觉和感情吗",\
             "突发事件发生时，你倾向于：",\
             "在同学聚会中，你通常：",\
             "学习时，你喜欢：",\
             "当别人和你发生思想上的冲突时，你会：",\
             "哪项描述与你较符合：",\
             "假如你在聚会上发现了有趣的陌生人，你会：",\
             "你会经常站在对方角度去思考而模糊了自己的立场吗",\
             "如果你有一个约会，你喜欢：",\
             "假如要处理数据，以下方式所需时间相等，你会：",\
             "你倾向于拥有：",\
             "你更愿意做什么样的工作呢",\
             "当你决策时，你会更相信",\
             "根据你的第一反应，谢尔顿(男主)画的是什么呢",\
             "对于视频中这道题，哪一部分在你的猜测中起更大的决定作用呢"]
OptionAtexts = ["出去玩，就算学习也要约上朋友到图书馆",\
             "情感上的相容性：对对方的情感需求敏感",\
             "有部署、模式固定的工作",\
             "让时间治愈",\
             "是的",\
             "是的",\
             "先观察收集信息或进行思考",\
             "听同学吹水",\
             "列出具体的知识点",\
             "试图和他争辩/讨论",\
             "喜欢立刻行动",\
             "主动去和他交谈",\
             "是的",\
             "计划好每个时间段的活动，以及吃什么",\
             "学习新的数据处理工具并用它进行处理",\
             "很多认识的人与很多亲密的朋友",\
             "简单但重复的",\
             "自己的经验",\
             "四个人和两块白板",\
             "巧克力豆"]
OptionBtexts = ["宅家",\
             "智慧上的相容性：注重交流自己的想法",\
             "灵活、松散度高的工作",\
             "跟朋友倾诉",\
             "不是",\
             "不易流露感情",\
             "马上做出反应",\
             "比较健谈",\
             "将知识点进行概括总结",\
             "理解这种差异",\
             "对各种选择进行反复斟酌",\
             "默默观察",\
             "不会",\
             "不做刻意安排，看情况而变",\
             "用已经掌握的数据处理工具",\
             "一些很亲密的朋友和一些认识的人",\
             "具有挑战性但困难的",\
             "目前已知的事实",\
             "现在",\
             "圆形的饼"]

Scores_0 = [0 for i in range(8)]  # MBTI各特征得分的初始列表
Scores = [0 for i in range(8)]  # 存放MBTI各特征得分：[ E, I, S, N, T, F, J, P ]

Idx2dim = {0: 'E', 1: 'I', 2: 'S', 3: 'N', 4: 'T', 5: 'F', 6: 'J', 7: 'P'}      # MBTI特征序号映射
OptionA2idx = [0, 5, 6, 1, 6, 5, 7, 1, 2, 5, 6, 0, 5, 6, 3, 0, 2, 5, 2, 2]       # 选项A对应的MBTI特征序号，列表长度为题目数Rounds
OptionB2idx = [1, 4, 7, 0, 7, 4, 6, 0, 3, 4, 7, 1, 4, 7, 2, 1, 3, 4, 3, 3]       # 选项B对应的MBTI特征序号，列表长度为题目数Rounds

MBTI = ''       # 测试结果：MBTI类型
person = ''     # 测试结果：MBTI类型对应的漫威人物
url = ''        # 测试结果：MBTI类型相关介绍网址url

MBTI2person = {'ISTJ': '美队', 'ISFJ': '格鲁特', 'INFJ': '死侍', 'INTJ': '灭霸',\
                'ESTJ': '尼克弗瑞', 'ESFJ': '蜘蛛侠', 'ENFJ': '金刚狼', 'ENTJ': '奇异博士',\
                'ISTP': '鹰眼', 'ISFP': '绿巨人', 'INFP': '旺达', 'INTP': '黑寡妇',\
                'ESTP': '钢铁侠', 'ESFP': '蚁人', 'ENFP': '雷神', 'ENTP': '钢铁侠'}       # MBTI到漫威人物的映射
person2pic = {'美队': '1', '格鲁特': '2', '死侍': '3', '灭霸': '4', '尼克弗瑞': '5',\
              '蜘蛛侠': '6', '金刚狼': '7', '奇异博士': '8', '鹰眼': '9', '绿巨人': '10',\
              '旺达': '11', '黑寡妇': '12', '钢铁侠': '13', '蚁人': '14', '雷神': '15'}     # 漫威人物对应的图片名称

